stanley-fork/Zero-Day-OS-/firmware/monsterc5/sdkconfig.defaults
# ZERO-DAY OS — M5MonsterC5 ESP32C5 firmware config
# Target: ESP32C5 (160MHz, 400KB SRAM, 4MB Flash)

CONFIG_IDF_TARGET="esp32c5"

# Serial console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM_0=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE_115200_BAUD=y

# WiFi
CONFIG_ESP_WIFI_ENABLED=y

# Memory optimization
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y